---
kind: method
id: M:Autodesk.Revit.DB.ViewSet.ReverseIterator
source: html/12a69c96-7ae7-8112-3eb0-f81b68aca3d4.htm
---
# Autodesk.Revit.DB.ViewSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual ViewSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.